rule('1') {
    _if_ = [{P.greaterThan fuzzySet(fuzzy(25, 50), fuzzy(30, 50))}, {CO}]
    _then_ = {
        X     = 'Промывка систем смазки двигателя'
        OT[1] = 'Обычное масло'
        OR[1] = ['Промывочное масло']
        ON[1] = ['Керосин', 'Бензин']
    }
}
rule('2') {
    _if_ = [{(D(2) - DX).greaterThan days(30)}]
    _then_ = {
        X     = 'Смазка подшипников передних колёс'
        OT[2] = 'Литол-24'
        OR[2] = ['Смазка 1-13']
        ON[2] = ['Солидол']
    }
}
rule('3') {
    _if_ = [{(DX - D(3)).greaterThan days(30)}]
    _then_ = {
        X     = 'Смазка подшипников карданных шарниров'
        OT[3] = 'Смазка №158'
        OR[3] = fuzzySet(fuzzy('Трансмиссионное масло', 20), fuzzy('Литол-24', 80))
        ON[3] = ['Солидол']
    }
}
rule('4') {
    _if_ = [{(DX - D(4)).greaterThan days(30)}]
    _then_ = {
        X     = 'Смазка шарниров передней подвески и рулевых тяг'
        OT[4] = 'ШРБ-4'
        OR[4] = ['Литол-24', 'Солидол']
        ON[4] = ['Смазка 1-13']
    }
}
rule('5') {
    _if_ = [{(DX - D(5)).greaterThan days(365)}]
    _then_ = {
        X     = 'Смазка тросов управления'
        OT[5] = 'Фиол-1'
        OR[5] = ['Литол-24', 'Смазка №158', 'ЦИАТИМ-201', 'Моторное масло']
        ON[5] = ['Солидол', 'Смазка 1-13']
    }
}
rule('6') {
    _if_ = [{(DX - D(6)).greaterThan days(365)}]
    _then_ = {
        X     = 'Смазка замков'
        OT[6] = 'Графитовый порошок'
        OR[6] = ['Тормозная жидкость', 'Антифриз', 'ВТВ-1']
        ON[6] = ['Обычное масло', 'Промывочное машинное масло', 'Трансмиссионное масло', 'Моторное масло']
    }
}
rule('7') {
    _if_ = [{or(CR,KR,DR)}]
    _then_ = {
        X     = 'Смазка шарикоподшипниковых узлов'
        OT[7] = 'Литол-24'
    }
}
rule('8') {
    _if_ = [{or(NB,CB)}]
    _then_ = {
        X     = 'Смазка резиновых втулок дроссельных заслонок карбюратора'
        OT[8] = 'Тормозная жидкость'
    }
}